spec/cassettes/StripeWrapper/StripeWrapper_Charge/_create/with_invalid_card/does_not_charge_the_card_successfully.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: US-ASCII
      string: card[number]=4000000000000002&card[exp_month]=3&card[exp_year]=2017&card[cvc]=314
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.16.0
      Authorization:
      - Bearer sk_test_baosbBV9JyrCUNS0GriM2Pr4
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.16.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"i686-linux","publisher":"stripe","uname":"Linux
        ubuntu-vbox 3.13.0-39-generic #66-Ubuntu SMP Tue Oct 28 13:31:23 UTC 2014
        i686 i686 i686 GNU/Linux"}'
      Content-Length:
      - '81'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 25 Nov 2014 02:14:40 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '623'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - d888d597-f4ea-4d94-b847-322f3be2eac8
      Stripe-Version:
      - '2014-11-20'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_152YqiHLIyFXpgjHT1JdoFc5",
          "livemode": false,
          "created": 1416881680,
          "used": false,
          "object": "token",
          "type": "card",
          "card": {
            "id": "card_152YqhHLIyFXpgjHkcf7gfsh",
            "object": "card",
            "last4": "0002",
            "brand": "Visa",
            "funding": "credit",
            "exp_month": 3,
            "exp_year": 2017,
            "fingerprint": "vxTW8vKJYZt5m0Fv",
            "country": "US",
            "name": null,
            "address_line1": null,
            "address_line2": null,
            "address_city": null,
            "address_state": null,
            "address_zip": null,
            "address_country": null,
            "dynamic_last4": null,
            "customer": null
          }
        }
    http_version: 
  recorded_at: Tue, 25 Nov 2014 02:14:37 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: US-ASCII
      string: amount=429&currency=usd&card=tok_152YqiHLIyFXpgjHT1JdoFc5
    headers:
      Accept:
      - "*/*; q=0.5, application/xml"
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.16.0
      Authorization:
      - Bearer sk_test_baosbBV9JyrCUNS0GriM2Pr4
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.16.0","lang":"ruby","lang_version":"2.1.2 p95 (2014-05-08)","platform":"i686-linux","publisher":"stripe","uname":"Linux
        ubuntu-vbox 3.13.0-39-generic #66-Ubuntu SMP Tue Oct 28 13:31:23 UTC 2014
        i686 i686 i686 GNU/Linux"}'
      Content-Length:
      - '57'
  response:
    status:
      code: 402
      message: Payment Required
    headers:
      Server:
      - nginx
      Date:
      - Tue, 25 Nov 2014 02:14:40 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '162'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - 5474ce81-1a92-4eca-8410-abc8797a94f9
      Stripe-Version:
      - '2014-11-20'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "error": {
            "message": "Your card was declined.",
            "type": "card_error",
            "code": "card_declined",
            "charge": "ch_152YqiHLIyFXpgjH5nnAjQ9E"
          }
        }
    http_version: 
  recorded_at: Tue, 25 Nov 2014 02:14:38 GMT
recorded_with: VCR 2.9.3
